## Plan Result (Prod)




<pre><code>Plan: 12 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.appeal-tax-tribunal.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.appeal-tax-tribunal.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.appeal-tax-tribunal.azurerm_dns_zone.zone
  * module.appeal-tax-tribunal.azurerm_role_assignment.dnszonecontributer
  * module.employment-tribunals.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.employment-tribunals.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.employment-tribunals.azurerm_dns_zone.zone
  * module.employment-tribunals.azurerm_role_assignment.dnszonecontributer
  * module.helpwithcourtfees.azurerm_dns_cname_record.this[&#34;afdverify.www&#34;]
  * module.helpwithcourtfees.azurerm_dns_cname_record.this[&#34;www&#34;]
  * module.helpwithcourtfees.azurerm_dns_zone.zone
  * module.helpwithcourtfees.azurerm_role_assignment.dnszonecontributer
* Update
  * module.apply-divorce.azurerm_dns_txt_record.this[&#34;_dnsauth.www&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.appeal-tax-tribunal.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "appeal-tax-tribunal.service.gov.uk"
    }

  # module.appeal-tax-tribunal.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "appeal-tax-tribunal.service.gov.uk"
    }

  # module.appeal-tax-tribunal.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "appeal-tax-tribunal.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"
    }

  # module.appeal-tax-tribunal.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.apply-divorce.azurerm_dns_txt_record.this["_dnsauth.www"] will be updated in-place
  ~ resource "azurerm_dns_txt_record" "this" {
        id                  = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformmgmtrg/providers/Microsoft.Network/dnsZones/apply-divorce.service.gov.uk/TXT/_dnsauth.www"
        name                = "_dnsauth.www"
        tags                = {}
      ~ ttl                 = 300 -> 3600
        # (3 unchanged attributes hidden)

      - record {
          - value = "validated" -> null
        }
      + record {
          + value = "5bz95ky3c27gb6475yz0yx2x1g4wg6qc"
        }
    }

  # module.employment-tribunals.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "employmenttribunals.service.gov.uk"
    }

  # module.employment-tribunals.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "employmenttribunals.service.gov.uk"
    }

  # module.employment-tribunals.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "employmenttribunals.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"
    }

  # module.employment-tribunals.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.helpwithcourtfees.azurerm_dns_cname_record.this["afdverify.www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.www"
      + record              = "afdverify.hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "helpwithcourtfees.service.gov.uk"
    }

  # module.helpwithcourtfees.azurerm_dns_cname_record.this["www"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www"
      + record              = "hmcts-prod.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "helpwithcourtfees.service.gov.uk"
    }

  # module.helpwithcourtfees.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "helpwithcourtfees.service.gov.uk"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"
    }

  # module.helpwithcourtfees.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2608a08f-b9d5-45a8-b641-207f574a0b60"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 12 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1334,"Program":"tfcmt","SHA1":"","Target":"Prod","Vars":{}} -->